import numpy as np

def sentence():
    explain_qwds = ['能否介绍一下','想了解','可以问一下','','能否告知','如何理解','','怎样解释','可以介绍','解释一下','解释解释']
    greet_qwds = ['你好，麻烦问一下','打扰问一下','','','您好','请问','请教一下','冒昧问一下','问一下','','']
    adress_qwds = ['在哪里', '位于什么省市', '在那个区', '地址', '是不是位于...', '是在...吗', '在哪?']
    sr_qwds = ['排第几', '排几名', '的高校排名', '能排多少', '有多厉害', '是第一吗', '能排多少名', '能进前100吗']
    employment_qwds = ['就业情况怎么样', '好就业吗', '能够干什么', '毕业生去向', '能找到好工作吗', '毕业可以找到工作吗', '就业可以吗', '毕业有好去处吗']
    recommend_qwds = ['有什么好专业', '有专业可以推荐吗', '王牌专业是什么', '可以选啥学院', '什么专业可以找到好工作', '有什么厉害的学科', '厉害的专业都有什么']
    result_qwds = ['学科评估结果', '建筑学是a+还是a', '经济学是b吗', 'a类学科有多少', '人工智能是a+吗', '今年学科评估情况', '有a类专业吗', '有几个b', 'c类专业有多少']
    grade_qwds = ['是专科吗', '是本科吗', '专科还是本科', '有没有专科', '有没有本科专业']
    admissions_qwds = ['招生办在哪里', '招生办电话', '招生政策', '招多少学生', '可不可以去这个学校']
    code_qwds = ['编码是多少', '代码' , '代码是几位数']
    tag_qwds = ['是985吗', '是211吗','是不是双一流高校', '民办还是私立', '是不是一本', '是国际知名高校吗', '是中国一流大学吗', '是不是职业学院', '是不是全国重点大学']
    type_qwds = ['是理工还是师范', '是艺术类学校吗', '是不是政法大学', '理工科强还是文科强', '是不是语言类学校']
    ratio_qwds = ['男女比例咋样', '男生多还是女生多', '可不可以交到女朋友', '有多少男生', '有多少女生', '男女比例平均吗']
    history_qwds = 



